# think_fast/model/yolo11n_5ch.yaml
#
# Modified YOLOv11-Nano backbone for 5-channel Early Fusion input.
#
# Changes vs. stock yolo11n.yaml:
#   - ch: 5  (was 3) — first Conv layer now accepts [R, G, B, Depth, Vel]
#   - All other architecture parameters are identical to yolo11n.
#
# Input tensor shape:  [B, 5, 640, 640]
# Output:              Standard YOLO detection format [x, y, w, h, conf, cls]
#
# References:
#   - YOLOv11 Ultralytics source: ultralytics/cfg/models/11/yolo11n.yaml
#   - Paper: "YOLOv11: An Overview of the Key Architectural Enhancements"
#
# ─────────────────────────────────────────────────────────────────────────────
# NOTE: Ultralytics uses the top-level `ch` field to set the number of input
# channels for the very first convolutional layer in the backbone. Setting
# ch: 5 here is sufficient — the framework propagates this through the model.
# ─────────────────────────────────────────────────────────────────────────────

# Global model parameters
nc: 10       # Number of detection classes (nuScenes: car, truck, bus, trailer,
             # construction_vehicle, pedestrian, motorcycle, bicycle, barrier, cone)
             # Adjust this to your final label set.

scales:
  # [depth, width, max_channels]  — "n" (nano) scale
  n: [0.50, 0.25, 1024]

# ── INPUT ─────────────────────────────────────────────────────────────────────
ch: 5        # ← KEY CHANGE: 5 input channels (RGB + Radar Depth + Radar Velocity)

# ── BACKBONE ──────────────────────────────────────────────────────────────────
# Format: [from, repeats, module, [args...]]
backbone:
  # P1/2 — Initial stem conv: 5 → 16 channels, 3×3, stride 2
  - [-1, 1, Conv, [16, 3, 2]]            # 0 — (B, 5, 640, 640) → (B, 16, 320, 320)

  # P2/4 — 16 → 32 channels, 3×3, stride 2
  - [-1, 1, Conv, [32, 3, 2]]            # 1 — (B, 16, 320, 320) → (B, 32, 160, 160)

  # C3k2 block — Efficient CSP-style repeatable cross-stage partial block
  - [-1, 2, C3k2, [64, False, 0.25]]    # 2 — (B, 32, 160, 160) → (B, 64, 160, 160)

  # P3/8
  - [-1, 1, Conv, [64, 3, 2]]            # 3 — → (B, 64, 80, 80)
  - [-1, 2, C3k2, [128, False, 0.25]]   # 4 — → (B, 128, 80, 80)

  # P4/16
  - [-1, 1, Conv, [128, 3, 2]]           # 5 — → (B, 128, 40, 40)
  - [-1, 2, C3k2, [256, True]]           # 6 — → (B, 256, 40, 40)

  # P5/32
  - [-1, 1, Conv, [256, 3, 2]]           # 7 — → (B, 256, 20, 20)
  - [-1, 2, C3k2, [512, True]]           # 8 — → (B, 512, 20, 20)

  # SPPF — Spatial Pyramid Pooling - Fast
  - [-1, 1, SPPF, [512, 5]]             # 9 — → (B, 512, 20, 20)

  # C2PSA — Cross-Stage Partial with Parallel Spatial Attention (YOLOv11 addition)
  - [-1, 2, C2PSA, [512]]               # 10 — → (B, 512, 20, 20)

# ── HEAD (FPN + PAN neck + Detect) ────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 — (B, 512, 40, 40)
  - [[-1, 6], 1, Concat, [1]]                    # 12 — (B, 768, 40, 40)
  - [-1, 2, C3k2, [256, False]]                  # 13 — (B, 256, 40, 40)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 — (B, 256, 80, 80)
  - [[-1, 4], 1, Concat, [1]]                    # 15 — (B, 384, 80, 80)
  - [-1, 2, C3k2, [128, False]]                  # 16 — P3 out (B, 128, 80, 80)

  - [-1, 1, Conv, [128, 3, 2]]                   # 17 — (B, 128, 40, 40)
  - [[-1, 13], 1, Concat, [1]]                   # 18 — (B, 384, 40, 40)
  - [-1, 2, C3k2, [256, False]]                  # 19 — P4 out (B, 256, 40, 40)

  - [-1, 1, Conv, [256, 3, 2]]                   # 20 — (B, 256, 20, 20)
  - [[-1, 10], 1, Concat, [1]]                   # 21 — (B, 768, 20, 20)
  - [-1, 2, C3k2, [512, False]]                  # 22 — P5 out (B, 512, 20, 20)

  # Detect head — inputs: P3 [16], P4 [19], P5 [22]
  - [[16, 19, 22], 1, Detect, [nc]]              # 23 — Output predictions
